{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "1be73810",
   "metadata": {},
   "source": [
    "# Conexión y Consultas a Neo4j\n",
    "He puesto en este notebook el código trasladado de un archivo python normal para trabajar con la base de datos Neo4j."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "id": "b7112b26",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Conexión a Neo4j establecida correctamente\n"
     ]
    }
   ],
   "source": [
    "\n",
    "from neo4j import GraphDatabase\n",
    "\n",
    "\n",
    "uri = \"neo4j+s://9513c9ad.databases.neo4j.io\"\n",
    "username = \"9513c9ad\"\n",
    "password = \"rHZJ1U1LwZhbQdPItq2UfEoYzTScVv241N_85ZarT2E\"\n",
    "\n",
    "driver = GraphDatabase.driver(uri, auth=(username, password))\n",
    "\n",
    "print(\"Conexión a Neo4j establecida correctamente\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "f5b51c96",
   "metadata": {},
   "source": [
    "## 2 Definir Neo4jConnection"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "id": "928d3c6e",
   "metadata": {},
   "outputs": [],
   "source": [
    "class Neo4jConnection:\n",
    "\n",
    "    def __init__(self, uri, user, pwd):\n",
    "        self.__uri = uri\n",
    "        self.__user = user\n",
    "        self.__pwd = pwd\n",
    "        self.__driver = None\n",
    "\n",
    "        try:\n",
    "            self.__driver = GraphDatabase.driver(self.__uri, auth=(self.__user, self.__pwd))\n",
    "        except Exception as e:\n",
    "            print(\"Failed to create the driver:\", e)\n",
    "\n",
    "    def close(self):\n",
    "        if self.__driver is not None:\n",
    "            self.__driver.close()\n",
    "\n",
    "    def query(self, query, parameters=None, db=None):\n",
    "        assert self.__driver is not None, \"Driver not initialized!\"\n",
    "        session = None\n",
    "        response = None\n",
    "\n",
    "        try:\n",
    "            session = self.__driver.session(database=db) if db is not None else self.__driver.session()\n",
    "            response = list(session.run(query, parameters))\n",
    "        except Exception as e:\n",
    "            print(\"Query failed:\", e)\n",
    "        finally:\n",
    "            if session is not None:\n",
    "                session.close()\n",
    "        return response"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "7883028b",
   "metadata": {},
   "source": [
    "## 3 Ejecutar la relación"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "id": "5db0e29a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Resultado de la consulta:\n",
      "<Record numNodos=5419536 numRelaciones=5419536>\n"
     ]
    }
   ],
   "source": [
    "\n",
    "conn = Neo4jConnection(uri=uri, user=username, pwd=password)\n",
    "\n",
    "\n",
    "query = ''' MATCH (n), ()-[r]->()\n",
    "            RETURN count(n) AS numNodos, count(r) AS numRelaciones'''\n",
    "\n",
    "result = conn.query(query)\n",
    "print(\"Resultado de la consulta:\")\n",
    "for record in result:\n",
    "    print(record)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "1e8bcc7c",
   "metadata": {},
   "source": [
    "## 4 Datos ID y propiedades de productos"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "10e5e791",
   "metadata": {},
   "outputs": [],
   "source": [
    "conn = Neo4jConnection(uri=uri, user=username, pwd=password)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "id": "359ec100",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "neo4j.graph.Node"
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Consulta de los cuatro primeros nodos Productos\n",
    "query = \"\"\" MATCH (n:Product)\n",
    "            RETURN n\n",
    "            LIMIT 4 \"\"\"\n",
    "\n",
    "result = conn.query(query)\n",
    "result\n",
    "type(result[0])\n",
    "type(result[0][\"n\"])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "f9afdc64",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Id: 4:d03cf31c-35f4-484d-abae-20fceb5d2175:89\n",
      "Etiquetas: frozenset({'Product'})\n",
      "Propiedades: {'unitPrice': 18.0, 'unitsInStock': 39, 'reorderLevel': 10, 'productID': '1', 'discontinued': False, 'productName': 'Chai', 'unitsOnOrder': 0}\n",
      "\n",
      "Id: 4:d03cf31c-35f4-484d-abae-20fceb5d2175:90\n",
      "Etiquetas: frozenset({'Product'})\n",
      "Propiedades: {'unitPrice': 19.0, 'unitsInStock': 17, 'reorderLevel': 25, 'productID': '2', 'discontinued': False, 'productName': 'Chang', 'unitsOnOrder': 40}\n",
      "\n",
      "Id: 4:d03cf31c-35f4-484d-abae-20fceb5d2175:91\n",
      "Etiquetas: frozenset({'Product'})\n",
      "Propiedades: {'unitPrice': 10.0, 'unitsInStock': 13, 'reorderLevel': 25, 'productID': '3', 'discontinued': False, 'productName': 'Aniseed Syrup', 'unitsOnOrder': 70}\n",
      "\n",
      "Id: 4:d03cf31c-35f4-484d-abae-20fceb5d2175:92\n",
      "Etiquetas: frozenset({'Product'})\n",
      "Propiedades: {'unitPrice': 22.0, 'unitsInStock': 53, 'reorderLevel': 0, 'productID': '4', 'discontinued': False, 'productName': \"Chef Anton's Cajun Seasoning\", 'unitsOnOrder': 0}\n",
      "\n"
     ]
    }
   ],
   "source": [
    "# Presente los datos Id, label y properties de forma visual\n",
    "for record in result:\n",
    "    print('Id:', record[\"n\"].element_id)\n",
    "    print('Etiquetas:', record[\"n\"].labels)\n",
    "    print('Propiedades:', dict(record[\"n\"]))\n",
    "    print('')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "id": "8aec9af0",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[<Record n=<Node element_id='4:d03cf31c-35f4-484d-abae-20fceb5d2175:89' labels=frozenset({'Product'}) properties={'unitPrice': 18.0, 'unitsInStock': 39, 'reorderLevel': 10, 'productID': '1', 'discontinued': False, 'productName': 'Chai', 'unitsOnOrder': 0}> r=<Relationship element_id='5:d03cf31c-35f4-484d-abae-20fceb5d2175:1152922604118474809' nodes=(<Node element_id='4:d03cf31c-35f4-484d-abae-20fceb5d2175:57' labels=frozenset({'Supplier'}) properties={'country': 'UK', 'supplierID': '1', 'contactTitle': 'Purchasing Manager', 'address': '49 Gilbert St.', 'city': 'London', 'phone': '(171) 555-2222', 'contactName': 'Charlotte Cooper', 'companyName': 'Exotic Liquids', 'postalCode': 'EC1 4SD', 'region': 'NULL', 'fax': 'NULL', 'homePage': 'NULL'}>, <Node element_id='4:d03cf31c-35f4-484d-abae-20fceb5d2175:89' labels=frozenset({'Product'}) properties={'unitPrice': 18.0, 'unitsInStock': 39, 'reorderLevel': 10, 'productID': '1', 'discontinued': False, 'productName': 'Chai', 'unitsOnOrder': 0}>) type='SUPPLIES' properties={}> s=<Node element_id='4:d03cf31c-35f4-484d-abae-20fceb5d2175:57' labels=frozenset({'Supplier'}) properties={'country': 'UK', 'supplierID': '1', 'contactTitle': 'Purchasing Manager', 'address': '49 Gilbert St.', 'city': 'London', 'phone': '(171) 555-2222', 'contactName': 'Charlotte Cooper', 'companyName': 'Exotic Liquids', 'postalCode': 'EC1 4SD', 'region': 'NULL', 'fax': 'NULL', 'homePage': 'NULL'}>>]"
      ]
     },
     "execution_count": 23,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Consulta de los nodos Productos y de los nodos Supplier conectados por una relación SUPPLIES\n",
    "query = \"\"\" MATCH (n:Product)<-[r:SUPPLIES]-(s:Supplier)\n",
    "            RETURN n,r,s\n",
    "            LIMIT 1 \"\"\"\n",
    "\n",
    "result = conn.query(query)\n",
    "result"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "id": "75945dd6",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[<Record path=<Path start=<Node element_id='4:d03cf31c-35f4-484d-abae-20fceb5d2175:1009' labels=frozenset({'Customer'}) properties={'country': 'Germany', 'contactTitle': 'Sales Representative', 'address': 'Forsterstr. 57', 'city': 'Mannheim', 'phone': '0621-08460', 'contactName': 'Hanna Moos', 'companyName': 'Blauer See Delikatessen', 'postalCode': '68306', 'customerID': 'BLAUS', 'region': 'NULL', 'fax': '0621-08924'}> end=<Node element_id='4:d03cf31c-35f4-484d-abae-20fceb5d2175:81' labels=frozenset({'Supplier'}) properties={'country': 'Canada', 'supplierID': '25', 'contactTitle': 'Marketing Manager', 'address': '2960 Rue St. Laurent', 'city': 'Montréal', 'phone': '(514) 555-9022', 'contactName': 'Jean-Guy Lauzon', 'companyName': 'Ma Maison', 'postalCode': 'H1J 1C3', 'region': 'Québec', 'fax': 'NULL', 'homePage': 'NULL'}> size=3>>]"
      ]
     },
     "execution_count": 24,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Consulta de los Productos comprados por Clientes, y de sus Proveedores\n",
    "query = \"\"\" MATCH path=(c:Customer)-[:PURCHASED]->()-[:ORDERS]->(:Product)<-[:SUPPLIES]-(:Supplier)\n",
    "            WHERE c.companyName = 'Blauer See Delikatessen'\n",
    "            RETURN path\n",
    "            LIMIT 1 \"\"\"\n",
    "\n",
    "result = conn.query(query)\n",
    "result"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "cec3a345",
   "metadata": {},
   "source": [
    "## 4 Cerrar la conexión"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "id": "8b38c4da",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Conexiones cerradas correctamente\n"
     ]
    }
   ],
   "source": [
    "\n",
    "conn.close()\n",
    "driver.close()\n",
    "\n",
    "print(\"Conexiones cerradas correctamente\")"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.1"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
